Revit 2017 API
AssetProperty.Dispose Method
Releases all resources used by the AssetProperty
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
AssetProperty Class
Autodesk.Revit.Utility Namespace